namespace DiscordGoose
{
    class Tasks
    {
		public static string[] Custom = new string[]
		{
				"?"
		};

		public static string[] Run = new string[]
		{
				"Бегу.",
				"Убегаю от хорошего выбора.",
				"Пытаюсь похудеть.",
				"Стоп, почему я бегу?"
		};

		public static string[] Walk = new string[]
		{
				"Бегаю в медленном темпе.",
				"Делаю обратную лунную походку.",
				"Топ-топ-топ-топ!",
				"Вышел на прогулку.",
				"Почему мои ноги такие громкие?",
				"Изучаю монитор.",
				"Громко шагаю."
		};

		public static string[] Charge = new string[]
		{
				"Бегу в невероятно быстром темпе.",
				"Превышаю скоростной режим.",
				"Скорость. Я — скорость.",
				"Злюсь."
		};

		public class Tasks_
		{
			public string[] Wander = new string[]
			{
				"Обдумываю жизненный выбор.",
				"Размышляю о мемах.",
				"Думаю о том, чтобы вызвать ещё больший хаос.",
				"Ищу больше способов создать проблемы.",
				"Что-то ищу..."
			};

			public string[] NabMouse = new string[]
			{
				"Кусаю мышь.",
				"Хрум-хрум.",
				"Выясняю, является ли мышь мышью.",
				"Гоняюсь за мышью."
			};

			public string[] CollectMeme = new string[]
			{
				"Перетаскиваю мемы.",
				"Отправляю мемы.",
				"Кидаю несколько гусиных-мемов.",
				"Мм, да. Гоготание сделанно из гудка."
			};

			public string[] CollectNotepad = new string[]
			{
				"Перетаскиваю заметку.",
				"Становлюсь удивительным поэтом.",
				"Даю очень важные жизненные советы.",
				"Печатаю двумя ногами.",
				"Тормошу пишущую машинку.",
				"Печатаю с закрытыми глазами."
			};

			public string[] TrackMud = new string[]
			{
				"Делаю экран грязнее.",
				"Я это почищу, наверное.",
				"Теперь это мой монитор.",
				"Удобрения для экрана."
			};

			public string[] CustomMouseNab = new string[]
			{
				"ONE PUNCHH!!",
				"Погоня за мышью на невероятно быстрой скорости.",
				"Why do I hear boss music?"
			};

			public string[] Sleeping = new string[]
			{
				"Zzzzzz...",
				"Мечтаю получать бесконечные колокольчики.",
				"Вызываю хаос во сне.",
				"О, удобненько.",
				"Сплю.",
				"Расслабляюсь."
			};

			public string[] RunToBed = new string[]
			{
				"Иду спать.",
				"Нашёл удобную кровать.",
				"Собираюсь вздремнуть.",
				"Думаю о сне.",
				"Иду к комфортной зоне."
			};

			public string[] ChargeToStick = new string[]
			{
				"О! Палка!",
				"Бегу за палкой.",
				"ДАЙТЕ! ДАЙТЕ! ДАЙТЕ!",
				"Обнаруженно движение палки!"
			};

			public string[] ReturnStick = new string[]
			{
				"Возвращаю палку!",
				"Палка успешно захвачена!"
			};

			public string[] ChaseLaser = new string[]
			{
				"Лазер обнаружен!",
				"Бесконечно гоняюсь за красной точкой."
			};

			public string[] ChargeToBall = new string[]
			{
				"Играю с мячиком.",
				"Пытаюсь укусить красный шар.",
				"Пытаюсь стать великим футболистом."
			};

			public string[] AttackingTheMonster = new string[]
			{
				"Бью плохих парней.",
				"Охота на хлебо-монстров!",
				"Качаю свой лвл."
			};
		}
	}
}
